## Descriptive Stats
- Measure of Central Tendency - Mean,Median,Mode
- Measure of Spread - SD, Variance, Range,IQR
- Measure of Shape - Skewness, Kurtosis

In [2]:
import pandas as pd

df = pd.read_csv('C:\\Users\\DELL\\Desktop\\Inc_Exp_Data.csv')
df.head()

,Mthly_HH_Income,Mthly_HH_Expense,No_of_Fly_Members,Emi_or_Rent_Amt,Annual_HH_Income,Highest_Qualified_Member,No_of_Earning_Members
0,5000,8000,3,2000,64200,Under-Graduate,1
1,6000,7000,2,3000,79920,Illiterate,1
2,10000,4500,2,0,112800,Under-Graduate,1
3,10000,2000,1,0,97200,Illiterate,1
4,12500,12000,2,3000,147000,Graduate,1

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Mthly_HH_Income           50 non-null     int64
 1   Mthly_HH_Expense          50 non-null     int64
 2   No_of_Fly_Members         50 non-null     int64
 3   Emi_or_Rent_Amt           50 non-null     int64
 4   Annual_HH_Income          50 non-null     int64
 5   Highest_Qualified_Member  50 non-null     object
 6   No_of_Earning_Members     50 non-null     int64
dtypes: int64(6), object(1)
memory usage: 2.9+ KB

In [5]:
df.describe(include='all')

,Mthly_HH_Income,Mthly_HH_Expense,No_of_Fly_Members,Emi_or_Rent_Amt,Annual_HH_Income,Highest_Qualified_Member,No_of_Earning_Members
count,50.000000,50.000000,50.000000,50.000000,5.000000e+01,50,50.000000
unique,NaN,NaN,NaN,NaN,NaN,5,NaN
top,NaN,NaN,NaN,NaN,NaN,Graduate,NaN
freq,NaN,NaN,NaN,NaN,NaN,19,NaN
mean,41558.000000,18818.000000,4.060000,3060.000000,4.900190e+05,NaN,1.460000
std,26097.908979,12090.216824,1.517382,6241.434948,3.201358e+05,NaN,0.734291
min,5000.000000,2000.000000,1.000000,0.000000,6.420000e+04,NaN,1.000000
25%,23550.000000,10000.000000,3.000000,0.000000,2.587500e+05,NaN,1.000000
50%,35000.000000,15500.000000,4.000000,0.000000,4.474200e+05,NaN,1.000000
75%,50375.000000,25000.000000,5.000000,3500.000000,5.947200e+05,NaN,2.000000
max,100000.000000,50000.000000,7.000000,35000.000000,1.404000e+06,NaN,4.000000

In [9]:
df['Highest_Qualified_Member']

0     Under-Graduate
1         Illiterate
2     Under-Graduate
3         Illiterate
4           Graduate
5           Graduate
6      Post-Graduate
7           Graduate
8     Under-Graduate
9     Under-Graduate
10    Under-Graduate
11        Illiterate
12        Illiterate
13          Graduate
14          Graduate
15          Graduate
16          Graduate
17    Under-Graduate
18          Graduate
19          Graduate
20    Under-Graduate
21      Professional
22      Professional
23      Professional
24          Graduate
25      Professional
26    Under-Graduate
27    Under-Graduate
28          Graduate
29          Graduate
30          Graduate
31      Professional
32     Post-Graduate
33     Post-Graduate
34          Graduate
35      Professional
36      Professional
37      Professional
38          Graduate
39     Post-Graduate
40          Graduate
41        Illiterate
42          Graduate
43          Graduate
44    Under-Graduate
45     Post-Graduate
46      Professional
47          Graduate
48      Professional
49     Post-Graduate
Name: Highest_Qualified_Member, dtype: object

In [8]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Mthly_HH_Income,50.0,41558.00,26097.908979,5000.0,23550.0,35000.0,50375.0,100000.0
Mthly_HH_Expense,50.0,18818.00,12090.216824,2000.0,10000.0,15500.0,25000.0,50000.0
No_of_Fly_Members,50.0,4.06,1.517382,1.0,3.0,4.0,5.0,7.0
Emi_or_Rent_Amt,50.0,3060.00,6241.434948,0.0,0.0,0.0,3500.0,35000.0
Annual_HH_Income,50.0,490019.04,320135.792123,64200.0,258750.0,447420.0,594720.0,1404000.0
No_of_Earning_Members,50.0,1.46,0.734291,1.0,1.0,1.0,2.0,4.0

#### Measure of Central Tendency

In [72]:
import pandas as pd
import numpy as np
import scipy.stats as stats

In [73]:
### Mean 

column = df.columns
for i in column:
    if df[i].dtype != 'O':
        print(df[i].mean())

41558.0
18818.0
4.06
3060.0
490019.04
1.46

In [74]:
### Median

column = df.columns
for i in column:
    if df[i].dtype != 'O':
        print(df[i].median())

35000.0
15500.0
4.0
0.0
447420.0
1.0

In [10]:
### Mode
df['Highest_Qualified_Member'].value_counts()
# Example of multimode
df[df['Highest_Qualified_Member'] != 'Graduate']['Highest_Qualified_Member'].mode()

0      Professional
1    Under-Graduate
Name: Highest_Qualified_Member, dtype: object

### Measure of Spread

In [87]:
# SD
df.std(numeric_only=True)

Mthly_HH_Income           26097.908979
Mthly_HH_Expense          12090.216824
No_of_Fly_Members             1.517382
Emi_or_Rent_Amt            6241.434948
Annual_HH_Income         320135.792123
No_of_Earning_Members         0.734291
dtype: float64

In [90]:
# Variance
df.var(numeric_only=True)

Mthly_HH_Income          6.811009e+08
Mthly_HH_Expense         1.461733e+08
No_of_Fly_Members        2.302449e+00
Emi_or_Rent_Amt          3.895551e+07
Annual_HH_Income         1.024869e+11
No_of_Earning_Members    5.391837e-01
dtype: float64

In [12]:
# Range 
range_of_df = df.drop(columns='Highest_Qualified_Member').max() - df.drop(columns='Highest_Qualified_Member').min()
range_of_df

Mthly_HH_Income            95000
Mthly_HH_Expense           48000
No_of_Fly_Members              6
Emi_or_Rent_Amt            35000
Annual_HH_Income         1339800
No_of_Earning_Members          3
dtype: int64

### Measure of Symmetricity & Shape

In [109]:
#Skewness
import scipy.stats as stats

skewness = stats.skew(df.drop(columns='Highest_Qualified_Member'))
skewness

array([0.89664199, 1.16317285, 0.11023511, 3.30070642, 1.15685814,
       1.54509796])

In [108]:
#Kurtosis

kurtosis = stats.kurtosis(df.drop(columns='Highest_Qualified_Member'))
kurtosis

array([-0.01333295,  0.73319606, -0.88629809, 12.70383813,  0.87655549,
        1.77202369])

In [25]:
import numpy as np

a = np.array([105, 156,145, 172, 100])
a.std()

28.401408415781077

In [19]:
mean_a = a.mean()

In [20]:
sum(square)

4

In [24]:
import math

square = 0
sum_of_square = 0
for i in a:
    square = pow((i - mean_a),2)
    sum_of_square += square
    
math.sqrt(sum_of_square/5)

28.401408415781077